; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared1 - mode
	image4 - mode
	spectrograph3 - mode
	infrared2 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star4 - direction
	Star5 - direction
	GroundStation0 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph0)
	(supports instrument1 image4)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Star7 infrared2)
	(have_image Star8 spectrograph3)
	(have_image Star9 thermograph0)
	(have_image Phenomenon10 thermograph0)
	(have_image Planet11 image4)
	(have_image Star12 spectrograph3)
	(have_image Phenomenon13 image4)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 thermograph0)
	(have_image Planet17 infrared2)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 phenomenon15 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 12
5. (take_image satellite0 phenomenon15 instrument1 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 1 of 12
6. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 12
7. (take_image satellite0 phenomenon14 instrument1 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon13 instrument1 image4)
   added: (have_image phenomenon13 image4)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon10 instrument1 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 4 of 12
12. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 4 of 12
13. (take_image satellite0 planet11 instrument1 image4)
   added: (have_image planet11 image4)
   goals met: 5 of 12
14. (turn_to satellite0 planet17 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet17)
   goals met: 5 of 12
15. (take_image satellite0 planet17 instrument1 infrared2)
   added: (have_image planet17 infrared2)
   goals met: 6 of 12
16. (turn_to satellite0 star12 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star12)
   goals met: 6 of 12
17. (take_image satellite0 star12 instrument1 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 7 of 12
18. (turn_to satellite0 star16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star16)
   goals met: 7 of 12
19. (take_image satellite0 star16 instrument1 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 8 of 12
20. (turn_to satellite0 star8 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star8)
   goals met: 8 of 12
21. (take_image satellite0 star8 instrument1 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 9 of 12
22. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 9 of 12
23. (take_image satellite0 star9 instrument1 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 10 of 12
24. (turn_to satellite0 star7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star7)
   goals met: 11 of 12
25. (take_image satellite0 star7 instrument1 infrared2)
   added: (have_image star7 infrared2)
   goals met: 12 of 12
